#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.company_investments_lambda_exec_role: Refreshing state... [id=demo_get_company_investments_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_company_lambda_function]
module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_report_handler.zip]
module.buckets.aws_s3_bucket_object.add_investment_function_object: Refreshing state... [id=lambdas/demo/add_investment_handler.zip]
module.buckets.aws_s3_bucket_object.delete_company_function_object: Refreshing state... [id=lambdas/demo/delete_company_handler.zip]
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.logs.aws_cloudwatch_log_group.add_investment_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_investment_lambda_function]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.logs.aws_cloudwatch_log_group.edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_edit_modify_data_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_options_lambda_function]
module.logs.aws_cloudwatch_log_group.add_scenario_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_scenario_lambda_function]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_investments_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_report_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_role.get_company_details_lambda_exec_role: Refreshing state... [id=demo_get_company_details_lambda_exec_role]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.policy.aws_iam_role.get_by_metric_report_lambda_exec_role: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.policy.aws_iam_role.update_data_lambda_exec_role: Refreshing state... [id=demo_update_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.policy.aws_iam_role.delete_company_lambda_exec_role: Refreshing state... [id=demo_delete_company_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_dynamic_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_dynamic_report_lambda_function]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metric_types_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_types_lambda_function]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/get_edit_modify_data_handler.zip]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/edit_modify_data_handler.zip]
module.policy.aws_iam_role.edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_metric_types_function_object: Refreshing state... [id=lambdas/demo/get_metric_types_handler.zip]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.buckets.aws_s3_bucket_object.add_scenario_function_object: Refreshing state... [id=lambdas/demo/add_scenario_handler.zip]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object: Refreshing state... [id=lambdas/demo/get_dynamic_report_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_details_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.buckets.aws_s3_bucket_object.get_company_investments_function_object: Refreshing state... [id=lambdas/demo/get_company_investments_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_date_report_handler.zip]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_options_handler.zip]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object: Refreshing state... [id=lambdas/demo/get_by_metric_report_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.buckets.aws_s3_bucket_object.delete_scenarios_function_object: Refreshing state... [id=lambdas/demo/delete_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.policy.aws_iam_role.add_investment_lambda_exec_role: Refreshing state... [id=demo_add_investment_lambda_exec_role]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.update_data_function_object: Refreshing state... [id=lambdas/demo/update_data.zip]
module.buckets.aws_s3_bucket_object.get_company_details_function_object: Refreshing state... [id=lambdas/demo/get_company_details_handler.zip]
module.policy.aws_iam_role.get_investment_date_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.policy.aws_iam_role.add_scenario_lambda_exec_role: Refreshing state... [id=demo_add_scenario_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.policy.aws_iam_role.delete_scenarios_lambda_exec_role: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_options_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.logs.aws_cloudwatch_log_group.update_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_update_data_lambda_function]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.policy.aws_iam_role.get_dynamic_report_lambda_exec_role: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.policy.aws_iam_role.get_edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_date_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_date_report_lambda_function]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.logs.aws_cloudwatch_log_group.get_by_metric_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_by_metric_report_lambda_function]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.policy.aws_iam_role.get_metric_types_lambda_exec_role: Refreshing state... [id=demo_get_metric_types_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_edit_modify_data_lambda_function]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.network.aws_api_gateway_resource.dynamic_report: Refreshing state... [id=7ce5jh]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.by_metric_report: Refreshing state... [id=890crw]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.investment_report: Refreshing state... [id=iew1mv]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.investment_date_report: Refreshing state... [id=ymo2z3]
module.network.aws_api_gateway_resource.investments: Refreshing state... [id=bumysj]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.edit_modify: Refreshing state... [id=qybsqa]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=8rc63h]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_vpc: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117152800000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_vpc: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154817160700000002]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_vpc: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436359500000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_vpc: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627406700000002]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_vpc: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328473300000001]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_vpc: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204627925600000001]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_vpc: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119918000000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704613000000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212704618600000002]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_vpc: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003397600000001]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_vpc: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648074600000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_vpc: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729143000000002]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_vpc: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628072200000003]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_logs: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436404000000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_logs: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204628035400000002]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_logs: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328477200000002]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212705003500000004]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_logs: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627405600000001]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_logs: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117408200000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_logs: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154816818700000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_logs: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729123500000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_logs: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628159500000004]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_logs: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648088100000002]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_logs: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003402400000002]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704618600000003]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_logs: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119943200000002]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_logs: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403233500000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_vpc: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403266900000002]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=w3jmtd]
module.network.aws_api_gateway_resource.dynamic_report_id: Refreshing state... [id=1c508f]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_vpc: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150845149600000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_logs: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150846115600000002]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.by_metric_report_id: Refreshing state... [id=f4ao8c]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.network.aws_api_gateway_resource.investment_report_id: Refreshing state... [id=ieupa8]
module.network.aws_api_gateway_resource.invest_year_options: Refreshing state... [id=gq814s]
module.network.aws_api_gateway_resource.company_investments: Refreshing state... [id=jd2xz9]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.company_details: Refreshing state... [id=hper4a]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.metric_types: Refreshing state... [id=qg9lk5]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=0bc6fs]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.update_data_lambda_function: Refreshing state... [id=demo_update_data_lambda_function]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.add_investment_lambda_function: Refreshing state... [id=demo_add_investment_lambda_function]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.functions.aws_lambda_function.get_company_investments_lambda_function: Refreshing state... [id=demo_get_company_investments_lambda_function]
module.functions.aws_lambda_function.get_investment_year_options_lambda_function: Refreshing state... [id=demo_get_investment_year_options_lambda_function]
module.functions.aws_lambda_function.get_metric_types_lambda_function: Refreshing state... [id=demo_get_metric_types_lambda_function]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.policy.aws_iam_role_policy.edit_modify_data_cognito_policy: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role:demo_edit_modify_data_cognito_policy]
module.functions.aws_lambda_function.get_dynamic_report_lambda_function: Refreshing state... [id=demo_get_dynamic_report_lambda_function]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.delete_company_cognito_policy: Refreshing state... [id=demo_delete_company_lambda_exec_role:demo_delete_company_cognito_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_by_metric_report_cognito_policy: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role:demo_get_by_metric_report_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_date_report_cognito_policy: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role:demo_get_investment_date_report_cognito_policy]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.policy.aws_iam_role_policy.get_company_details_cognito_policy: Refreshing state... [id=demo_get_company_details_lambda_exec_role:demo_get_company_details_cognito_policy]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_edit_modify_data_cognito_policy: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role:demo_get_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_year_report_cognito_policy: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role:demo_get_investment_year_report_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_dynamic_report_cognito_policy: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role:demo_get_dynamic_report_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.delete_scenarios_cognito_policy: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role:demo_delete_scenarios_cognito_policy]
module.policy.aws_iam_role_policy.add_scenario_cognito_policy: Refreshing state... [id=demo_add_scenario_lambda_exec_role:demo_add_scenario_cognito_policy]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.functions.aws_lambda_function.get_edit_modify_data_lambda_function: Refreshing state... [id=demo_get_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_investment_date_report_lambda_function: Refreshing state... [id=demo_get_investment_date_report_lambda_function]
module.functions.aws_lambda_function.get_investment_year_report_lambda_function: Refreshing state... [id=demo_get_investment_year_report_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.functions.aws_lambda_function.delete_company_lambda_function: Refreshing state... [id=demo_delete_company_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.delete_scenarios_lambda_function: Refreshing state... [id=demo_delete_scenarios_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_by_metric_report_lambda_function: Refreshing state... [id=demo_get_by_metric_report_lambda_function]
module.functions.aws_lambda_function.get_company_details_lambda_function: Refreshing state... [id=demo_get_company_details_lambda_function]
module.functions.aws_lambda_function.add_scenario_lambda_function: Refreshing state... [id=demo_add_scenario_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.edit_modify_data_lambda_function: Refreshing state... [id=demo_edit_modify_data_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_api_gateway_method.get_company_details_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_method.get_company_investments_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_method.add_investment_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_method.delete_company_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_investment_year_options_method: Refreshing state... [id=agm-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_method.get_investment_year_report_method: Refreshing state... [id=agm-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.get_by_metric_report_method: Refreshing state... [id=agm-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_method.dynamic_report_method: Refreshing state... [id=agm-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.delete_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_method.get_metric_types_method: Refreshing state... [id=agm-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.add_scenario_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_method.get_investment_date_report_method: Refreshing state... [id=agm-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-PUT]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_api_gateway_integration.company_investments_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-GET]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.add_investment_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_integration.get_edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.get_company_details_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-GET]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_api_gateway_integration.delete_company_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.invest_year_options_integration: Refreshing state... [id=agi-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.by_metric_report_integration: Refreshing state... [id=agi-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.dynamic_report_integration: Refreshing state... [id=agi-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_integration.investment_report_integration: Refreshing state... [id=agi-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_integration.delete_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.add_company_scenario_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.investment_date_report_integration: Refreshing state... [id=agi-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-PUT]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.network.aws_api_gateway_integration.get_metric_types_integration: Refreshing state... [id=agi-kb7gblbu69-qg9lk5-GET]
module.policy.aws_lambda_permission.apigw_get_investment_year_options_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_delete_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_by_metric_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]
module.policy.aws_lambda_permission.apigw_get_metric_types_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_company_investments_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyInvestmentsId]
module.policy.aws_lambda_permission.apigw_get_dynamic_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_add_investment_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_get_investment_date_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_add_scenario_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_get_investment_year_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_delete_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "ffaf85d133c9c184c07582cd787e5d92" -> "4c708c2aaae7346bc9e8fcbaaa8da1e4"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "1483e7d164599aaf29189ecbd9b1f67a" -> "a470722e1aec6b944deba4995a882c44"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "0b93b3a8721612fc534e42d88913a77e" -> "ef91f497631109ba281157e1de484f5a"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "8b6c15183b21860b4cd6b2bc1c7bcb3d" -> "2fc6e6724ab7a5efa3eac03087689ec5"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "328ac37b6cb37b653ca9ee2df01474ff" -> "78a090e6391144c1f3ef6a34512375d9"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "9d8246cff4555be6bc81e7a2ea7d274e" -> "32cda7449546e1455a5c4c007991cebd"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "e20072fc2f2f29dc5d24ac43195045ba" -> "3b6124e742d4f1beefbd98053147cbbe"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "c81c913a68bb19e501649a82a36eec66" -> "bd413326fa3f0451e7f378f163645477"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c31f8c4db60ed5832347e8086131fb64" -> "3c3f2a6229853ae2d6cd3a5fbe7d1313"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "14f790dd2f07c180658cdd26604d811c" -> "755d573e82243fbbb68962db80933b38"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "748482aba836cf2e2c87b3defd613f4c" -> "c772e7a4d73d0d6fe983646f17d72d6b"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "96080140b3438b039a87660f9c8e03e8" -> "46d566f90936e6f245eb5e0dabbf4ba3"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1acffc2f2587f612dd4d47ee70726769" -> "86e77aca49e640c050ac13713f70f8d0"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "9a6f0e1494f37666c628a54ee02c0ac9" -> "04826e89c613485dae7edab079ed51a3"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "4f207e2dd9fd391f563af0ec5fc9d7ac" -> "452cd6ede1dc3f25455da11ed6936353"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "017e2f49487f8d917f8dde3c2ea91c6f" -> "136b15f43d522a990b9658bbfef770c5"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "21a929b2ed5113f031fc453d2c2ad1c1" -> "52480ec76789cb5c3cd05ef3589edd11"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "67ff82c1b3156283cc31ff7a48c78ef5" -> "a6c9dc6f1d92f52828ec4f4dae1d5e17"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6d84f6b29508ceefb989fc4d5abff9ec" -> "e0126ea8584a0a85f30578dd035ec488"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "afcb1ad95c7ee81e12987e7c5e8e5e71" -> "df47de11e2442f02ebf006e530bbc981"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "d19ca7ee1c978beaf61cc91549511420" -> "14be55b3f1001308f84dcc2e1877943d"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "397f24691736d43cf2a0efe6a822d8f1" -> "98056ec3042e08312af9611c220ea2bb"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "2b9cde3bd9349502057e30ad2705adc2" -> "97a92611186e34a838ab331b60d4f667"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "68fe3f5e676e2d8af404a91626ae7937" -> "b0dc098d30916f101336c10798dd9d69"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      ~ etag               = "f219467465e8eb2dbafcd46458f73e51" -> "bd31bc05cd2fe211b4463ea6ca9ef646"
        id                 = "lambdas/demo/get_investment_year_options_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      ~ etag               = "8d465b2afd15928bb1ef44bfef90cdde" -> "48286d72b1853013374770fdf84ae54f"
        id                 = "lambdas/demo/get_investment_year_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "671858c669031588f5f3b358e1e94b4b" -> "e436f9c2bff2bee102e32658c4804466"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "486933fcb17a519ae506ce5dd254a407" -> "191b942f27534cba3382abe270597838"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "9d0ceba9a03d851a7f65b7830c378a67" -> "244044347b989641713c38949b972d28"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "d4c590e1dcb3020a3e7018eed526633c" -> "ff2f73c25462db9f08b57a2788fb09cc"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "61f1e0e74bdc479d012f4fa690d944bf" -> "c1088df5a6c0cdcf1a45fee25f0045c0"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "ece82ded681bc5b8d732a940b57902c5" -> "90a47216caa3c1bca45795ff45bc517c"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "6fbcb3ea1635bbc66c232e50da7b360c" -> "6007781bd9ebe9cd6e22550cc2da778c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2b24d8c26bfc33ac3e500cb883244cda" -> "ec7c07e5a9f1b0600fafe7cd37d31169"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "bd8003bfeba1d00560dffce7b4b0ca29" -> "8e736afdb81db3609b2f3d2b9eeeac69"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "362b5574b4db3b3fcbdf0c8677c85def" -> "7a5b6af6f5cbab0111b94bb74782f28a"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "642f1a909aaa4a6df4b417837b689c98" -> "853ef22a1b263834eaba21397c1180c9"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "07e03fbda4baa1e4d6f3d544cc468c65" -> "7efab10bcd4c0444a7b8ac3d4e4771cb"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "67b1b18e3c8af03dcd21083cdb329ae8" -> "14596a67069489874a07b717a36ffca7"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:42.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "N5Le5ZBTXfFRMWJIyQxRTgtcW8PjkZOYwDnsUPg6Rak=" -> "29fq/b9kPTF/Ajct9c/yPd9gcKfR/aVk+vevgwCDV+Y="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "qZWLaAyVYG/H+8CzhmbfxHaJ58vRbtevlXFolzEYNHY=" -> "Th40TdLKDwtxc5gr5fIIZW2P6CcLxQHLVHohWGMv1mA="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "qGhNz+tVohBG2bVasRCLYw6n/XuGne2KHu5VTchQvzM=" -> "x0G3mmx5jLRHYGmqL5kAyQHVIFrI3Q0MobQDnmYWfHQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "TB35uKK/AbzgcGE12KolV6Km/nu4u2Yooi4zS5tce5I=" -> "lbKD9JruR/KvfEf7kfv4OH94KpOpZA4bp4vzXGuEzQc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:00.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "nFCOMBZHN09AsDLsTRq2GxEHzEI6Ni4jaj8eQB+BRa0=" -> "nLRPxJQbDFgGW5JxvC43Gw7mOF1dr1XW07b2/HFbO0o="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "nTWCUnDUQwypBozVedmh0PRwR1Ytn1KSNf0hRE4ASOA=" -> "gSFvspH3OlG7sf9bWF1Vvt9QWmSi9ck4sAfVgk4sSTk="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "iI0sYy/sd1RPOGtQvWUWJ0bwIzjQcJyw9ZR+O4wNFiA=" -> "O/McH2ZibBaiMa4Z/ZAaO/lXPyUG7iaal+VfD602Bto="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "WpXN1vuZd/u3KgfhUys1oDvmOy1KPd1RW2yKsjfvHV4=" -> "hD/94brM3mUqlCU1AE/2dkorTGCBUyXvOpVTYlZK3Eg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:40.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "mUdIA46cB+vYDdxfgWyZO/0adQVVQfGBUkylVqydtyI=" -> "Yofk0kq9zzrdbImrrofYzOepJjuXSsQ5UHbcUzKhI/0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "DyGlHESBmiIFiWloIjntW7myfp23l3dzCT0nqe578E8=" -> "rbjbvbFi2qqG1y/NQYm1k1+ht5K4QeSAbAX35jCgnw0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:54.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "gEFLw652hx4LP9IlqrbNpQRZ3U2LfJE2bfZUs2Ddh0k=" -> "3iOmKm80E6/QkajBvpZHSw6TL+sljebD2aPiGlfYWhM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "BELqJo2OG5A+lFtzZoHdXVGCWyIC18GkNZAQszi0vD0=" -> "2CSAnOog7QzupA/Zno2IWrTcRmQoXQ/5k3DS/yLIxs8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "WcALi8HxLT76zirw+K9Vt0BF10p/7tPKiBBZQLuyCBk=" -> "ZQBJtzIm0795U6EhfHZed+a6YMj9QfkWGYKRjDsFkis="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "+/9vKvUCyWTzPp8ZrR7Xzu8jJrqcq0lLYZOQnc49t0A=" -> "a2+KcDD2/zz+DD4DvRkxvzCxiC5ajatuZUc9H1JoM/w="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "NKdoaTc9/0v81zNwORvip6nk0l8nPPwMsrMIlwx99DM=" -> "Zojeoty2h65WVcSZa0PiR2M1spFUHRn0PvBk0eTIXtw="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "F6rudHvSJO9IxpA63pI+aZ5xBVNYl5zHvwQHO4rl0RI=" -> "g/CoA4KQ00o4H3Hn5HolTdtINc73wPfPn2rJnB6sahc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "2gS4Uyee8ofL5z8b7tshLorQFjcgjBS45yN5LaKKZJ4=" -> "DrZnf8iqK23Pp3VzGrxng7aSbOOwA6FBzf0W6FbQwdM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:46.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "9Mwne2QWbIzOLZzFsy92T277AZwGSZu3vp+nSlkPyzw=" -> "4MFkfBRK1K/N1UbXqRdQSL8ZcSfBLlnESTm4ZerzYts="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "aJGTmo1KySBkthe8duY3YoEbIWK3Y6N0zM5CtWhVL3g=" -> "vhZUSLsb0b6jU9rk0PuUhELRQiMy83k/H0/262I5WEw="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "He+vlsJCcIxtMUwAxluwJobg4+8UIWKTdEdn6VaF3JI=" -> "ltKrqpGHvgTEmMw+nVL+1OQK1p7Th6V8VPFA3jqIa0E="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "7fwDGIXLsgqVT0nC7IHWkZZAHaj0EszmUav7MEp7BkI=" -> "OIoH8JtyYfTZcrQe4T/ssoUL+0Xdmu+VZo+5PzDUCfs="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:25.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "L7AAyw/jxj+G38RoFHgS/eRC4yhmHG04Nw1UHxScdI8=" -> "cecaLrIWqFs1rtox9tcZqygkxCCygrbNszzV5X3z3iU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "s3MAknkVTMHcss7cdaxo6eXQ6JVr/O2WJPnHMkekrFU=" -> "aCpRM1QLIirUC0Ey8O4EaQehDb10oEWhGM15pOomsI8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:39.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "dLWusm+PExFaMc6DujrZ7oC241D7DQ69Xr4LJsB6RNs=" -> "j8hOueb/ZACQRuBvIurIoCO07WD7ZXfPu4FFmwYLMEE="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
        id                             = "demo_get_investment_year_options_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "h9OlDzQUvc62y94STWPT1am5pv0cBSfIUU0QnXmWB3A=" -> "9O0o+RB3gOzkLsoPBPCY4CQNK11XnB28FPAutL30DlU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
        id                             = "demo_get_investment_year_report_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "5qfnrEWWjDnMyRAttWObqm0UdMaiF6/dwCiH9VOV8cA=" -> "RQEDes+WB2wbT9c3uT1KD42TjzU+GKN/qdq5wiVJCNQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:25.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "DrFA6RmwCBS28hIH/TKARPX9VWRMJc21AAjMB05F8wo=" -> "IUSiWTA0RBOOcBrpeSdu5j2Sqe5ldCIM8dYC4Q3dEnY="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "GfCn6BiszpDsAbexv7mBBgx+niA2xNllBb7L0/pDNkA=" -> "DQ5RX+wZWf/fdRgJyD+UPpErCuxp4vRVMXYqLp1k0qg="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "uY+bGQ+KBxl1J+H/id31r6dip5yIelrtuJpq30ZQJA0=" -> "DqPS8/vYOd2wQTeb1fOqnX73UBbihUoLUQ+O16qJqaM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "0pWzGaYKuN5xbn5o2CXyPRzk8Y1xiX6KVfGl0wqGOBc=" -> "HCdROnE/x0QPlD7uVgQEDpr1NR5ZJjMvxbFfH8ySBWs="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "QUCo2SqOcyDEq2kToQ3R+FRuBHf/wfESlUuOyfytwys=" -> "hroUqCjGMtE1FMGwCE468wbFWfuqwNc1Lz75ggs4Rtc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "cyMXXXNXh5hYvKMklke4AkenK5BXXJCQtF7E4gXB4D4=" -> "5nJbiUmVfuukRMbl79thlkcnQpgayy1oLr+jf9U/oUc="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "gM5ZwqggxPSgcyWMOSGCnLqHPeahfYVntx2qHSgTzpY=" -> "NB428cHQpRy0DP2MYHqfz8haMbmolIg3kTmwFvnnHRs="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "PqjiiNJr2vGhk74i2Z9q6kQPtUfDeLxvITWzrqV+PA8=" -> "4FDixeAP5jmKXL0SWtZAW8Nka6k7N4xyJFpHcwqEmew="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "DflzjQlR4pNAWEb8cMxi2KIyqIZsiNSFYErWC/NcGyo=" -> "lNNM08Mw2Kq7FmoZ0LJGRF44LKtjw1GPm+zDGsrc7z0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:45.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "pAoi1x/a9BXCkTPtJByIdGbaY/XimCpTz5sRUEkzyJY=" -> "r0YR+fJ3pumougmJmt5/rpMoj38oP+OKi90x8nKFoSg="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-09-13T20:20:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "wRxa4pWD/PDq6bwJvRYoXAb9uskfL68PYgfRUdeug9E=" -> "5tjGLxfx+Afi04pBVch83uzlWejKtF9LKpf/Lcf4ydM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-09-13T20:21:01.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16",
        ] -> (known after apply)
      ~ source_code_hash               = "ZmVboehDzsASN9jBh+oeqGzZFRziT0EiKm3+IKVZb6E=" -> "adKIHKuGqh4GWhyKzC71bi8JCkus0P/uzE64wQDgprg="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_layer_version.db_lambda_layer must be replaced
+/- resource "aws_lambda_layer_version" "db_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16" -> (known after apply)
      ~ created_date                = "2022-09-13T20:20:09.531+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "da98LGcsnIHumY9H1EfKWXmjJMYaLch5na78V+YDFcc=" -> "EzQd6BaT2e5XfLNScB2A0B3XJfMp4CdCSjSmvaYZ+4M=" # forces replacement
      ~ source_code_size            = 34938057 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-09-13T20:20:00Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "w3jmtd" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-09-13T20:19:59Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-09-13T20:19:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 79 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*